tutorials/Woodward&Colella/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// FoamX Case Dictionary.

FoamFile
{
    version         2.0;
    format          ascii;

    root            "/home/Luca/OpenFOAM/Luca-1.3/run/tests/Forwardstep";
    case            "step_central";
    instance        "constant/polyMesh";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

arguments       "/home/Luca/OpenFOAM/Luca-1.3/run/tests/Forwardstep/step_central" off;

convertToMeters 1;

vertices        
(
    (0 0 -0.05)
    (0.6 0 -0.05)
    (0 0.2 -0.05)
    (0.6 0.2 -0.05)
    (3 0.2 -0.05)
    (0 1 -0.05)
    (0.6 1 -0.05)
    (3 1 -0.05)
    (0 0 0.05)
    (0.6 0 0.05)
    (0 0.2 0.05)
    (0.6 0.2 0.05)
    (3 0.2 0.05)
    (0 1 0.05)
    (0.6 1 0.05)
    (3 1 0.05)
);

blocks          
(
    hex (0 1 3 2 8 9 11 10) (24 10 1) simpleGrading (1 1 1)
    hex (2 3 6 5 10 11 14 13) (24 40 1) simpleGrading (1 1 1)
    hex (3 4 7 6 11 12 15 14) (96 40 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch inlet 
    (
        (0 8 10 2)
        (2 10 13 5)
    )
    patch outlet 
    (
        (4 7 15 12)
    )
    symmetryPlane bottom 
    (
        (0 1 9 8)
    )
    symmetryPlane top 
    (
        (5 13 14 6)
        (6 14 15 7)
    )
    patch obstacle 
    (
        (1 3 11 9)
        (3 4 12 11)
    )
);

mergePatchPairs 
(
);


// ************************************************************************* //
