tutorials/Woodward&Colella/0/U
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Field Dictionary

FoamFile
{
    version         2.0;
    format          ascii;

    root            "/home/Luca/OpenFOAM/Luca-1.3/run/tests/Forwardstep";
    case            "step_central";
    instance        "0";
    local           "";

    class           volVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (3 0 0);

boundaryField
{
    inlet           
    {
        type            fixedValue;
        value           uniform (3 0 0);
    }

    outlet          
    {
        type            zeroGradient;
    }

    bottom          
    {
        type            symmetryPlane;
    }

    top             
    {
        type            symmetryPlane;
    }

    obstacle        
    {
        type            slip;
    }

    defaultFaces    
    {
        type            empty;
    }
}


// ************************************************************************* //
