tutorials/Woodward&Colella/system/fvSchemes
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// FoamX Case Dictionary.

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

AeroFoamSchemes
{
//............................Time integration
    timeScheme           RK2;
    CourantMax           0.0;
    CourantSteps         25;
//............................Space integration
    flowType             Euler;
    MonotoneFlux         Roe;
    HighResolutionFlux   LW;
    fluxLimiter          VL;
    entropyFix           HH2;
//............................Boundary conditions evaluation
    extrapolateBC        1;    
//............................Residual evaluation
    residualNorm         L1;  
    writeResidual        0; 
    minResidual          -1;
//............................Extended cells connectivity 
    loadConnectivity     0;
    adaptiveConnectivity 1;
    testMesh             0;
//............................Check for errors
    testInput            1; 
}

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
}

laplacianSchemes
{
    default         none;
}

interpolationSchemes
{
    default         linear;
    reconstruct(p)  Gamma 1.0;
    reconstruct(U)  Gamma 1.0;
    reconstruct(T)  Gamma 1.0;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
